import UIKit

// A卷：对10、30、50、...、470、490这组数求和
// B卷：对15、25、35、...、485、495这组数求和
// 可能a卷要求用for in循环，b卷要求用while循环，也可能都没做限制

// A卷：生成一组随机数，然后用if else分支去判断这组数据属于哪一个成绩等级
// B卷：生成一组随机数，然后用switch case分支去判断这组数据属于哪一个成绩等级
// 成绩等级分五组，优秀（a卷是90~100以此类推，范围无所谓，b卷也差不多）、良好、？？、合格、不合格，这几个等级需要装在一个数组内

// A卷：运用函数重载的知识，先判断两个int数的大小，再判断两个浮点数的大小
// B卷：运用函数重载的知识，先判断两个int数的大小，再判断三个int数的大小？（不太确定）

// 都是分别用函数和闭包的知识去求面积和体积，a卷是长方体体积，b卷是直角三角形面积

// 结构体和闭包，写一个白猫结构体，然后定义属性（身高体重这些），定义一个方法drink，定义一个静态方法run。写一个黑猫类，然后定义属性（身高体重这些，比白猫少一个string类型的属性），定义一个方法drink，定义一个 类 方法run，还要构造一个初始化函数吧。再把白猫和黑猫里面的属性和方法初始化、实例化、并且调用
// b卷好像就是老师和学生，应该差不多
