//
//  RoleData.swift
//  HuiYanKill
//
//  Created by QHuiYan on 2023/3/27.
//

import Foundation

let roleData: Array<Dictionary<String, String>> = [QiHuiYan, Dilin, QinZheng, HuiZhu, WangJue, WuYue, SuHuan, YaGeBu, LongGui, LongHua, unknown0, unknown1, unknown2, unknown3, unknown4, unknown5, unknown6, unknown7]

let QiHuiYan = ["序号": "0","插画": "qihuiyan.jpg", "角色": "七绘言", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let Dilin = ["序号": "1","插画": "dilin.png", "角色": "帝临", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let QinZheng = ["序号": "2","插画": "qinzheng.jpg", "角色": "秦政", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let HuiZhu = ["序号": "3","插画": "huizhu.jpg", "角色": "绘竹", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let WangJue = ["序号": "4","插画": "wangjue.jpg", "角色": "王珏", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let WuYue = ["序号": "5","插画": "wuyue.jpg", "角色": "舞玥", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let SuHuan = ["序号": "6","插画": "suhuan.jpg", "角色": "苏幻", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let YaGeBu = ["序号": "7","插画": "yagebu.jpg", "角色": "雅各布", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let LongGui = ["序号": "8","插画": "", "角色": "龙姽", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let LongHua = ["序号": "9","插画": "", "角色": "龙婳", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let unknown0 = ["序号": "9","插画": "", "角色": "", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let unknown1 = ["序号": "9","插画": "", "角色": "", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let unknown2 = ["序号": "9","插画": "", "角色": "", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let unknown3 = ["序号": "9","插画": "", "角色": "", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let unknown4 = ["序号": "9","插画": "", "角色": "", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let unknown5 = ["序号": "9","插画": "", "角色": "", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let unknown6 = ["序号": "9","插画": "", "角色": "", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

let unknown7 = ["序号": "9","插画": "", "角色": "", "生命": "300", "体力": "100", "攻击": "130", "防御": "50"]

